In [16]:
#data analysis and manipulation
#new col creation
import numpy as np
import pandas as pd
ds1=[1,2,3,4,5,6]
p1=pd.Series(ds1)
print(p1)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [19]:
print("max",p1.max())
print("min",p1.min())
print("sum",p1.sum())
print("mean",p1.mean())

max 6.0
min 1.0
sum 21.0
mean 3.5

In [22]:
p1[6]=np.nan
print(p1)
p1.isnull()
print("sum",p1.sum())

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    NaN
dtype: float64
sum 21.0

In [20]:
#dnt skip 
p1.mean(skipna=False)

nan

In [21]:
#skips nan value
p1.count()

6

In [23]:
p1.fillna(100)#no chnagein original

0      1.0
1      2.0
2      3.0
3      4.0
4      5.0
5      6.0
6    100.0
dtype: float64

In [24]:

print(p1)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    NaN
dtype: float64

In [25]:
#if orginal ones need to be chnaged
p1.fillna(200,inplace=True)
print(p1)

0      1.0
1      2.0
2      3.0
3      4.0
4      5.0
5      6.0
6    200.0
dtype: float64

In [29]:
p1.describe()
p1[7]=1

In [36]:
p2=pd.Series(['a','b'])
print(p2.describe())
print(p2.sort_index())#acsending=false gives in descending order

count     2
unique    2
top       a
freq      1
dtype: object
0    a
1    b
dtype: object

In [37]:
#frequecy of number
p1.value_counts()

1.0      2
2.0      1
3.0      1
4.0      1
5.0      1
6.0      1
200.0    1
dtype: int64

In [40]:
#sort accroding to index
#p1.sort_index()
print(p1.sort_index(kind='mergesort'))

0      1.0
1      2.0
2      3.0
3      4.0
4      5.0
5      6.0
6    200.0
7      1.0
dtype: float64

In [42]:
p3=pd.DataFrame({'names':['shreya','tejas','sakshi','pallu','piya'],"Maths":np.random.randint(70,90,5)})
print(p3)

    names  Maths
0  shreya     82
1   tejas     75
2  sakshi     84
3   pallu     79
4    piya     78

In [43]:
p3.columns

Index(['names', 'Maths'], dtype='object')

In [44]:
p3.dtypes

names    object
Maths     int32
dtype: object

In [45]:
p3.shape

(5, 2)

In [47]:
p1.head(1)

0    1.0
dtype: float64

In [48]:
p1.tail(4)

4      5.0
5      6.0
6    200.0
7      1.0
dtype: float64

In [82]:
#p3[columnlabel][rowlabel]
#loc works with labels
p3['Maths'][4]

78

In [55]:
#iloc works with index
p3['english']=[90,80,70,60,50]
print(p3)

    names  Maths  english
0  shreya     82       90
1   tejas     75       80
2  sakshi     84       70
3   pallu     79       60
4    piya     78       50

In [57]:
p3.describe()

           Maths    english
count   5.000000   5.000000
mean   79.600000  70.000000
std     3.507136  15.811388
min    75.000000  50.000000
25%    78.000000  60.000000
50%    79.000000  70.000000
75%    82.000000  80.000000
max    84.000000  90.000000

In [58]:
p3.Maths.describe()

count     5.000000
mean     79.600000
std       3.507136
min      75.000000
25%      78.000000
50%      79.000000
75%      82.000000
max      84.000000
Name: Maths, dtype: float64

In [59]:
p3.english.describe()

count     5.000000
mean     70.000000
std      15.811388
min      50.000000
25%      60.000000
50%      70.000000
75%      80.000000
max      90.000000
Name: english, dtype: float64

In [60]:
p3.describe(include='O')

         names
count        5
unique       5
top     shreya
freq         1

In [62]:
p3.rename(columns={'names':'Studentname'})

  Studentname  Maths  english
0      shreya     82       90
1       tejas     75       80
2      sakshi     84       70
3       pallu     79       60
4        piya     78       50

In [76]:
p3.rename(index={'a':0})

    names  Maths  english
0  shreya     82       90
1   tejas     75       80
2  sakshi     84       70
3   pallu     79       60
4    piya     78       50

In [77]:
p3['Total']=p3['Maths']+p3['english']
print(p3)

    names  Maths  english  Total
0  shreya     82       90    172
1   tejas     75       80    155
2  sakshi     84       70    154
3   pallu     79       60    139
4    piya     78       50    128

In [78]:
p3.to_csv("student.csv")

In [81]:
p3["Grade"]=p3['Total'].apply(lambda x:"A" if x>150 else "B")
print(p3)

    names  Maths  english  Total Grade
0  shreya     82       90    172     A
1   tejas     75       80    155     A
2  sakshi     84       70    154     A
3   pallu     79       60    139     B
4    piya     78       50    128     B